[
  {
    "id": 1,
    "title": "Что было бы, если бы интернет был изобретен в 19 веке?",
    "intro": "Представьте мир, где технологии телеграфа эволюционировали в глобальную сеть обмена информацией за 100 лет до нашего времени.",
    "changed": [
      "Викторианские \"серверы\" на паровой тяге",
      "Механические поисковые системы с перфокартами",
      "Глобальная телеграфная сеть как предтеча интернета",
      "Криптография как обязательный школьный предмет"
    ],
    "disappeared": [
      "Централизованные монархии (сложнее контролировать информацию)",
      "Медленные дипломатические процессы",
      "Региональные диалекты (более быстрая унификация языка)",
      "Концепция \"местных новостей\""
    ],
    "consequences": {
      "internet": "\"Всемирная паутина\" из медных проводов и телеграфных столбов. Сайты — это физические локации с перфораторами и считывателями.",
      "people": "Общество стало более технически грамотным, но также более параноидальным из-за утечек шифрованных сообщений.",
      "technology": "Паровые компьютеры, аналитические машины Бэббиджа как стандарт, ранняя кибернетика."
    },
    "conclusion": "Технологический прогресс опередил социальный, создав мир продвинутых технологий при архаичных общественных структурах."
  },
  {
    "id": 2,
    "title": "Что было бы, если бы человечество никогда не изобрело колесо?",
    "intro": "Альтернативная история, где фундаментальное изобретение человечества так и не было создано, что изменило всю траекторию развития цивилизации.",
    "changed": [
      "Транспорт на воздушной подушке (изобретен раньше)",
      "Развитые системы каналов и водного транспорта",
      "Архитектура без круглых элементов",
      "Магнитные дороги для перемещения грузов"
    ],
    "disappeared": [
      "Колесный транспорт (автомобили, поезда, велосипеды)",
      "Конвейерное производство",
      "Часы со стрелками",
      "Спортивные игры с мячом"
    ],
    "consequences": {
      "internet": "Развивался бы медленнее из-за сложностей с логистикой и созданием инфраструктуры.",
      "people": "Города были бы компактнее, сосредоточены вокруг водных артерий. Путешествия стали бы редким и значимым событием.",
      "technology": "Акцент на левитации, магнетизме и гидравлике. Механика вращательного движения осталась бы неизведанной областью."
    },
    "conclusion": "Цивилизации пришлось найти обходные пути для фундаментальных проблем, что привело к совершенно иному технологическому укладу."
  },
  {
    "id": 3,
    "title": "Что было бы, если бы книги остались привилегией элиты?",
    "intro": "Мир, где печатный станок Гутенберга был уничтожен сразу после изобретения, а грамотность стала секретом, охраняемым правящим классом.",
    "changed": [
      "Устная традиция как основной способ передачи знаний",
      "Развитая мнемоническая культура",
      "Профессия \"говорящих книг\" (людей, запоминающих тексты)",
      "Табу на письменность для низших классов"
    ],
    "disappeared": [
      "Массовое образование",
      "Научные журналы и академические публикации",
      "Библиотеки в современном понимании",
      "Новости в печатном формате"
    ],
    "consequences": {
      "internet": "Никогда не был бы изобретен, так как не возникло бы концепции демократизации информации.",
      "people": "Общество строго стратифицировано. Власть знания абсолютна. Критическое мышление — навык элиты.",
      "technology": "Технический прогресс замедлен в тысячу раз. Каждое изобретение — тщательно охраняемый секрет гильдий."
    },
    "conclusion": "Контроль над информацией оказался мощнее контроля над ресурсами, создав стабильное, но абсолютно статичное общество."
  },
  {
    "id": 4,
    "title": "Что было бы, если бы фотосинтез возник у животных?",
    "intro": "Представьте эволюционный путь, где животные развили способность получать энергию от солнца, изменив пищевые цепочки и социальные структуры.",
    "changed": [
      "Гибридные существа с растительными и животными признаками",
      "Миграции по солнечным циклам, а не сезонам",
      "Конкуренция за солнечные места вместо пищи",
      "Симбиоз с растениями на клеточном уровне"
    ],
    "disappeared": [
      "Традиционная пищевая цепь (хищники-жертвы)",
      "Агрессия как основной инструмент выживания",
      "Крупные пищеварительные системы",
      "Концепция \"приёма пищи\" в привычном понимании"
    ],
    "consequences": {
      "internet": "Развивался бы как сеть обмена питательными веществами и солнечными данными, а не информацией.",
      "people": "Человечество было бы рассеяно по планете для максимального поглощения солнечного света, города не возникли бы.",
      "technology": "Технологии были бы сосредоточены на оптике, накоплении солнечной энергии и биосинтезе, а не механике."
    },
    "conclusion": "Солнце стало бы валютой и смыслом существования, превратив планету в гигантский, медленный организм."
  }
]
