[
  {
    "id": 1,
    "title": "Что было бы, если бы интернет был изобретен в 19 веке?",
    "intro": "Представьте мир, где технологии телеграфа эволюционировали в глобальную сеть обмена информацией за 100 лет до нашего времени.",
    "changed": [
      "Викторианские \"серверы\" на паровой тяге",
      "Механические поисковые системы с перфокартами",
      "Глобальная телеграфная сеть как предтеча интернета",
      "Криптография как обязательный школьный предмет"
    ],
    "disappeared": [
      "Централизованные монархии (сложнее контролировать информацию)",
      "Медленные дипломатические процессы",
      "Региональные диалекты (более быстрая унификация языка)",
      "Концепция \"местных новостей\""
    ],
    "consequences": {
      "internet": "\"Всемирная паутина\" из медных проводов и телеграфных столбов. Сайты — это физические локации с перфораторами и считывателями.",
      "people": "Общество стало более технически грамотным, но также более параноидальным из-за утечек шифрованных сообщений.",
      "technology": "Паровые компьютеры, аналитические машины Бэббиджа как стандарт, ранняя кибернетика."
    },
    "conclusion": "Технологический прогресс опередил социальный, создав мир продвинутых технологий при архаичных общественных структурах."
  },
  {
    "id": 2,
    "title": "Что было бы, если бы человечество никогда не изобрело колесо?",
    "intro": "Альтернативная история, где фундаментальное изобретение человечества так и не было создано, что изменило всю траекторию развития цивилизации.",
    "changed": [
      "Транспорт на воздушной подушке (изобретен раньше)",
      "Развитые системы каналов и водного транспорта",
      "Архитектура без круглых элементов",
      "Магнитные дороги для перемещения грузов"
    ],
    "disappeared": [
      "Колесный транспорт (автомобили, поезда, велосипеды)",
      "Конвейерное производство",
      "Часы со стрелками",
      "Спортивные игры с мячом"
    ],
    "consequences": {
      "internet": "Развивался бы медленнее из-за сложностей с логистикой и созданием инфраструктуры.",
      "people": "Города были бы компактнее, сосредоточены вокруг водных артерий. Путешествия стали бы редким и значимым событием.",
      "technology": "Акцент на левитации, магнетизме и гидравлике. Механика вращательного движения осталась бы неизведанной областью."
    },
    "conclusion": "Цивилизации пришлось найти обходные пути для фундаментальных проблем, что привело к совершенно иному технологическому укладу."
  },
  {
    "id": 3,
    "title": "Что было бы, если бы книги остались привилегией элиты?",
    "intro": "Мир, где печатный станок Гутенберга был уничтожен сразу после изобретения, а грамотность стала секретом, охраняемым правящим классом.",
    "changed": [
      "Устная традиция как основной способ передачи знаний",
      "Развитая мнемоническая культура",
      "Профессия \"говорящих книг\" (людей, запоминающих тексты)",
      "Табу на письменность для низших классов"
    ],
    "disappeared": [
      "Массовое образование",
      "Научные журналы и академические публикации",
      "Библиотеки в современном понимании",
      "Новости в печатном формате"
    ],
    "consequences": {
      "internet": "Никогда не был бы изобретен, так как не возникло бы концепции демократизации информации.",
      "people": "Общество строго стратифицировано. Власть знания абсолютна. Критическое мышление — навык элиты.",
      "technology": "Технический прогресс замедлен в тысячу раз. Каждое изобретение — тщательно охраняемый секрет гильдий."
    },
    "conclusion": "Контроль над информацией оказался мощнее контроля над ресурсами, создав стабильное, но абсолютно статичное общество."
  },
  {
    "id": 4,
    "title": "Что было бы, если бы Python был создан как низкоуровневый язык?",
    "intro": "Представьте альтернативную вселенную, где Гвидо ван Россум создал Python как системный язык вместо C, а не как высокоуровневый скриптовый.",
    "changed": [
      "Python доминирует в разработке ОС и драйверов",
      "Системное программирование с отступами в 4 пробела",
      "Машинное обучение пишется на ассемблере",
      "Веб-фреймворки на C++ и Rust"
    ],
    "disappeared": [
      "Jupyter Notebooks и интерактивная аналитика",
      "Быстрое прототипирование и скриптование",
      "Популярность Python в Data Science",
      "Простота как главная ценность языка"
    ],
    "consequences": {
      "internet": "Веб-серверы на Python работают в 10 раз быстрее, но разработка сложнее. Django и Flask — удел хардкорных инженеров.",
      "people": "Разработчики стали более педантичными, меньше творчества, больше системного мышления. Сообщество меньше в 10 раз.",
      "technology": "Операционные системы написаны на чистом Python с его GIL. Параллелизм — священный грааль компьютерных наук."
    },
    "conclusion": "Python стал бы инструментом элиты системных программистов, потеряв свою демократическую сущность и философию доступности."
  },
  {
    "id": 5,
    "title": "Что было бы, если бы блокчейн изобрели в 80-е годы?",
    "intro": "Децентрализованные реестры появляются на заре интернета, когда ARPANET только начинает превращаться во всемирную сеть.",
    "changed": [
      "Децентрализованный интернет по умолчанию",
      "Электронная почта как транзакции в блокчейне",
      "Ранняя криптоэкономика вместо доткомов",
      "DNS на блокчейне с самого начала"
    ],
    "disappeared": [
      "Централизованные интернет-провайдеры",
      "Монополии вроде Google и Facebook",
      "Сертификационные центры",
      "Концепция \"доверенного посредника\""
    ],
    "consequences": {
      "internet": "Сайты — это смарт-контракты. Провайдеры — это ноды. Цензура технически невозможна, но и регулирование тоже.",
      "people": "Поколение выросло с мышлением sovereignty и self-custody. Доверие к институтам заменено криптографическими доказательствами.",
      "technology": "Квантовые компьютеры разрабатываются в первую очередь для взлома блокчейнов 80-х. Криптография опережает время на 30 лет."
    },
    "conclusion": "Интернет родился свободным, но так и не научился масштабироваться — каждое обновление требует консенсуса миллионов нод."
  },
  {
    "id": 6,
    "title": "Что было бы, если бы CSS мог самообучаться?",
    "intro": "Стили, которые адаптируются к пользователю, предугадывают дизайнерские тренды и пишут сами себя на основе минимальных промптов.",
    "changed": [
      "Дизайн-системы, которые эволюционируют самостоятельно",
      "Адаптивность не через медиа-запросы, а через ИИ",
      "Персонализированные UI для каждого пользователя",
      "Автоматическая а11у (accessibility)"
    ],
    "disappeared": [
      "Ручное написание медиа-запросов",
      "Дизайн-макеты в Figma",
      "Проблемы с cross-browser compatibility",
      "Ручная оптимизация производительности"
    ],
    "consequences": {
      "internet": "Сайты становятся живыми организмами. Дизайн — это не застывшая форма, а процесс. Каждый видит свой идеальный интерфейс.",
      "people": "Дизайнеры превращаются в тренеров ИИ. Разработчики пишут промпты вместо кода. UX становится действительно user-centered.",
      "technology": "Браузеры превращаются в нейронные сети. Рендеринг — это inference. Lighthouse уходит в прошлое — ИИ сам оптимизирует всё."
    },
    "conclusion": "Красота стала адаптивной, но предсказуемость дизайна ушла в прошлое — интернет превратился в хаос перфекционизма."
  },
  {
    "id": 7,
    "title": "Что было бы, если бы JavaScript работал на сервере с момента создания?",
    "intro": "1995 год: Брендан Айк создает JavaScript как полноценный язык для клиента и сервера, а не только для анимации кнопок.",
    "changed": [
      "Fullstack JavaScript с середины 90-х",
      "Node.js не нужно было создавать",
      "Единый язык на всех уровнях стека",
      "Ранние SPA на 10 лет раньше"
    ],
    "disappeared": [
      "PHP, Perl, Python в веб-разработке",
      "Проблемы CORS и разрыв клиент-сервер",
      "Необходимость в TypeScript",
      "Серверные шаблонизаторы вроде JSP"
    ],
    "consequences": {
      "internet": "Веб с самого начала строится как приложения, а не документы. Прямая манипуляция DOM с сервера. Realtime по умолчанию.",
      "people": "Разработчики мыслят целостно. Нет разделения на frontend/backend. Архитектура изоморфных приложений — стандарт с 2000-х.",
      "technology": "V8 появляется раньше. JIT-компиляция в 90-е. JavaScript на嵌入式 устройствах. Веб — это ОС из коробки."
    },
    "conclusion": "Веб-разработка стала проще, но монокультура JavaScript задушила языковое разнообразие и альтернативные подходы к архитектуре."
  },
  {
    "id": 8,
    "title": "Что было бы, если бы квантовые компьютеры появились в 2000 году?",
    "intro": "Квантовая революция происходит одновременно с дотком-бумом, меняя фундамент информационных технологий на заре века.",
    "changed": [
      "Квантовый интернет вместо классического",
      "Шифрование на квантовых ключах с рождения соцсетей",
      "Квантовые процессоры в каждом смартфоне",
      "ИИ, обученный на квантовых нейросетях"
    ],
    "disappeared": [
      "Классическая криптография (RSA, ECC)",
      "Традиционные алгоритмы оптимизации",
      "Проблема P vs NP (решена квантовыми вычислениями)",
      "Ограничения законов Мура"
    ],
    "consequences": {
      "internet": "Сайты работают в суперпозиции. Контент адаптируется не по cookies, а по квантовым состояниям пользователя. Логика — вероятностная.",
      "people": "Человечество мыслит вероятностными категориями. Принятие решений — это квантовые вычисления. Детерминизм — пережиток прошлого.",
      "technology": "Транзисторы устарели до того, как достигли нанометров. Кремниевая эра длилась 20 лет. Холодильники для кубитов в каждом доме."
    },
    "conclusion": "Технологии ушли в квантовую сложность, сделав компьютеры могущественными, но полностью непонятными для обычного человека."
  },
  {
    "id": 9,
    "title": "Что было бы, если бы React использовал MVC вместо компонентов?",
    "intro": "Facebook выпускает React как фреймворк в стиле Angular или Ember, а не как библиотеку компонентов.",
    "changed": [
      "Единая архитектура для всех фронтенд-фреймворков",
      "Жесткое разделение Model-View-Controller",
      "Двустороннее связывание данных как стандарт",
      "Фронтенд как серверный рендеринг с бэкенд-логикой"
    ],
    "disappeared": [
      "Виртуальный DOM и его оптимизации",
      "Функциональные компоненты и хуки",
      "Экосистема React Native",
      "Концепция однонаправленного потока данных"
    ],
    "consequences": {
      "internet": "SPA становятся тяжелее, но структурированнее. Меньше свободы, больше конвенций. Веб похож на десктопные приложения 2000-х.",
      "people": "Разработчики тратят меньше времени на выбор архитектуры, но больше на boilerplate код. Меньше инноваций, больше стабильности.",
      "technology": "React бы не породил Vue.js. Angular доминировал бы. TypeScript стал бы обязательным. Web Components не понадобились бы."
    },
    "conclusion": "Фронтенд-разработка стала предсказуемее, но потеряла ту гибкость, что породила современную экосистему компонентов."
  },
  {
    "id": 10,
    "title": "Что было бы, если бы GitHub был платным с самого начала?",
    "intro": "2008 год: Том Престон-Вернер создает GitHub как премиум-сервис для корпораций, а не как бесплатную платформу с open-source.",
    "changed": [
      "Git остаётся инструментом элиты",
      "Монетизация через платные аккаунты",
      "Корпоративный контроль над open-source",
      "Медленное распространение Git"
    ],
    "disappeared": [
      "Бесплатные публичные репозитории",
      "Социальное кодирование как феномен",
      "Быстрое распространение open-source",
      "GitHub как портфолио разработчиков"
    ],
    "consequences": {
      "internet": "Open-source развивается на независимых форумах и FTP. Нет единой платформы. Linux и Python распространяются через пиринговые сети.",
      "people": "Разработчики работают в изоляции. Нет культуры pull requests. Меньше сотрудничества между компаниями. Сильные сообщества только вокруг мегапроектов.",
      "technology": "SVN и Mercurial не умирают. Инструменты децентрализованнее. CI/CD сложнее настраивать. Деплой — это до сих пор rsync на сервер."
    },
    "conclusion": "Индустрия сохранила контроль над кодом, но потеряла ту синергию, что сделала современную разработку глобальным сотрудничеством."
  },
  {
    "id": 11,
    "title": "Что было бы, если бы TypeScript был создан Microsoft в 90-е?",
    "intro": "Андерс Хейлсберг создает TypeScript одновременно с C#, делая статическую типизацию стандартом для веба с самого начала.",
    "changed": [
      "JavaScript со статической типизацией с рождения",
      "TypeScript как стандарт, а не надстройка",
      "Ранняя IDE-поддержка в Visual Studio",
      "WebAssembly появляется на 15 лет раньше"
    ],
    "disappeared": [
      "Динамическая типизация в вебе",
      "Ошибки типов во время выполнения",
      "Долгие дебаты о необходимости TypeScript",
      "JSDoc как способ документирования типов"
    ],
    "consequences": {
      "internet": "Веб-приложения надежнее, но сложнее в прототипировании. Меньше стартапов, больше корпоративных решений. Веб — это Java-апплеты, но лучше.",
      "people": "Разработчики думают об архитектуре прежде кода. Меньше хакатонов, больше планирования. Фронтенд становится backend-разработкой.",
      "technology": "Браузеры включают TS-компилятор. Node.js не нужен — TS выполняется напрямую. NPM — это типизированный реестр с контрактами."
    },
    "conclusion": "Веб стал надёжнее для больших компаний, но потерял ту хаотичную креативность, что породила jQuery, React и современный фронтенд."
  },
  {
    "id": 12,
    "title": "Что было бы, если бы Docker изобрели в эпоху мейнфреймов?",
    "intro": "Контейнеризация появляется в 70-е, когда компьютеры были размером с комнату, а программы — перфокартами.",
    "changed": [
      "Контейнеры как стандарт для мейнфреймов",
      "Ранняя стандартизация сред выполнения",
      "Виртуализация на уровне ОС в 80-е",
      "Микросервисы до монолитов"
    ],
    "disappeared": [
      "Проблема \"работает на моей машине\" в 90-е",
      "Традиционные методы деплоя (FTP, rsync)",
      "Виртуальные машины как промежуточный этап",
      "Сложности с dependency hell"
    ],
    "consequences": {
      "internet": "Серверные фермы 90-х используют контейнеры. Веб-хостинг — это продажа контейнеров. AWS появляется на 10 лет раньше как контейнерный провайдер.",
      "people": "Системные администраторы — это DevOps с 80-х. Разработчики думают о production с первого дня. Нет разделения dev/ops культур.",
      "technology": "UNIX становится ещё более модульным. Ядра ОС проектируются для контейнеров. Облако — это не революция, а естественная эволюция."
    },
    "conclusion": "Инфраструктура стала предсказуемой, но индустрия пропустила тот хаос 90-х, что научил нас ценить стабильность и воспроизводимость."
  },
  {
    "id": 13,
    "title": "Что было бы, если бы API всегда были GraphQL?",
    "intro": "Facebook открывает GraphQL в 2012, но что если эта концепция была стандартом с первых дней веб-сервисов?",
    "changed": [
      "Единый endpoint для всех данных",
      "Клиенты сами определяют структуру ответа",
      "Статическая типизация API по умолчанию",
      "REST никогда не становится популярным"
    ],
    "disappeared": [
      "Проблема over-fetching и under-fetching",
      "Версионирование API через URL (v1, v2)",
      "Необходимость в Swagger/OpenAPI",
      "Множественные HTTP-запросы для данных"
    ],
    "consequences": {
      "internet": "Фронтенд и бэкенд тесно связаны через схемы. Мобильные приложения загружают только нужные данные. Веб быстрее, но сложнее в кешировании.",
      "people": "Разработчики мыслят в терминах графов данных. Продукт-менеджеры проектируют схемы. Тестировщики валидируют типы, а не статус-коды.",
      "technology": "Базы данных проектируются для GraphQL. SQL уступает GraphQL-запросам. CDN не работают — каждый запрос уникален. Кеширование на клиенте."
    },
    "conclusion": "Данные стали гибче, но предсказуемость производительности ушла — каждый запрос уникальная снежинка, которую нельзя оптимизировать заранее."
  },
  {
    "id": 14,
    "title": "Что было бы, если бы программирование было запатентованной профессией?",
    "intro": "Как медицина или юриспруденция, программирование требует лицензии, сертификации и регулирования государством.",
    "changed": [
      "Лицензированные разработчики",
      "Сертифицированные языки и фреймворки",
      "Юридическая ответственность за баги",
      "Профессиональная этика кодекс"
    ],
    "disappeared": [
      "Самоучки и буткемпы",
      "Открытая разработка без контроля",
      "Быстрые итерации и MVP",
      "Эксперименты в production"
    ],
    "consequences": {
      "internet": "Сайты надежнее, но обновляются раз в год. Каждая строка кода проверена коллегией. Хакерство — это медицинская практика без лицензии.",
      "people": "Разработчики — уважаемая элита с зарплатами как у хирургов. Меньше инноваций, больше стандартов. Карьера — это десятилетия учебы и практики.",
      "technology": "Технологии развиваются медленно, но стабильно. Нет JavaScript-фреймворков каждый год. Python 2 всё ещё поддерживается. Бэкворд-совместимость священна."
    },
    "conclusion": "Софтвер стал надёжным как мосты, но индустрия потеряла ту скорость, что позволила интернету захватить мир за 20 лет."
  },
  {
    "id": 15,
    "title": "Что было бы, если бы Wi-Fi работал на квантовой запутанности?",
    "intro": "Беспроводные сети используют квантовую запутанность для мгновенной связи независимо от расстояния.",
    "changed": [
      "Интернет без задержек по всей планете",
      "Зашифрованная связь по умолчанию",
      "Глобальная синхронизация в реальном времени",
      "Мгновенные загрузки любого контента"
    ],
    "disappeared": [
      "Пинг и latency как понятия",
      "Кеширование контента (CDN)",
      "Геоблокировки и региональные ограничения",
      "Офлайн-режим (всё всегда онлайн)"
    ],
    "consequences": {
      "internet": "Сайты работают как локальные приложения. Многопользовательские игры без лагов. Видеозвонки в 8K без буферизации. Интернет — это нервная система планеты.",
      "people": "Человечество всегда на связи. Нет понятия \"в роуминге\". Цифровой разрыв только в доступе к устройствам, а не к сети.",
      "technology": "Серверы нужны только для хранения, не для обработки запросов. Edge computing — это каждый девайс. Облако — это распределённый мозг."
    },
    "conclusion": "Связь стала идеальной, но человечество потеряло возможность отключаться — цифровая жизнь слилась с физической в единый поток."
  },
  {
    "id": 16,
    "title": "Что было бы, если бы HTML включал встроенный AI?",
    "intro": "Спецификация HTML6 включает теги с искусственным интеллектом, который понимает контент и адаптирует его под пользователя.",
    "changed": [
      "<ai-content> для динамического контента",
      "<ai-layout> для адаптивного дизайна",
      "<ai-personalize> для кастомизации",
      "<ai-optimize> для производительности"
    ],
    "disappeared": [
      "Ручная адаптивность",
      "A/B-тестирование через код",
      "Персонализация через бэкенд",
      "SEO-оптимизация вручную"
    ],
    "consequences": {
      "internet": "Сайты живые и обучающиеся. Контент меняется под каждого. Дизайн — это не код, а обучение ИИ. Веб — это нейронная сеть.",
      "people": "Дизайнеры — тренеры ИИ. Разработчики — промпт-инженеры. Пользователи — источники данных для обучения. Контент-менеджеры — кураторы ИИ.",
      "technology": "Браузеры — это ИИ-платформы. Рендеринг — это inference. Кеширование — это запоминание паттернов. Код — это веса нейросети."
    },
    "conclusion": "Веб стал умным, но непредсказуемым — каждый видит свою версию интернета, и общего опыта больше не существует."
  },
  {
    "id": 17,
    "title": "Что было бы, если бы npm использовал блокчейн для пакетов?",
    "intro": "Каждый пакет в npm — это смарт-контракт на блокчейне с автоматическими выплатами авторам и неизменяемой историей версий.",
    "changed": [
      "Неизменяемые пакеты (никаких left-pad инцидентов)",
      "Автоматические роялти авторам",
      "Децентрализованный реестр зависимостей",
      "Прозрачная статистика использования"
    ],
    "disappeared": [
      "Централизованные реестры",
      "Проблемы с удалением пакетов",
      "Недостаток финансирования open-source",
      "Неясное авторское право"
    ],
    "consequences": {
      "internet": "Зависимости надёжнее, но медленнее. Каждый require — транзакция в блокчейне. node_modules весит терабайты из-за всей истории.",
      "people": "Разработчики зарабатывают на своих пакетах. Меньше спама, больше качества. Сообщество — это экономика. Контрибьюция — это инвестиция.",
      "technology": "JavaScript-разработка требует криптокошелька. Установка пакетов — это майнинг. CI/CD платит за зависимости. Безопасность через прозрачность."
    },
    "conclusion": "Open-source стал устойчивой экономикой, но барьер входа вырос — чтобы установить left-pad, нужно купить Ethereum и понять смарт-контракты."
  },
  {
    "id": 18,
    "title": "Что было бы, если бы CSS Grid был изобретен в 2005?",
    "intro": "Сложная сеточная система для CSS появляется на 10 лет раньше, когда таблицы были стандартом, а flexbox не существовал.",
    "changed": [
      "Ранняя смерть табличной вёрстки",
      "CSS Grid как стандарт для сложных макетов",
      "Веб-дизайн становится более сложным раньше",
      "Адаптивность без медиа-запросов"
    ],
    "disappeared": [
      "Таблицы для вёрстки",
      "Попытки создать сетки на float",
      "Необходимость в CSS-фреймворках для сеток",
      "Сложные хаки для выравнивания"
    ],
    "consequences": {
      "internet": "Сайты 2008 выглядят как современные. Меньше хака, больше семантики. Веб-дизайн эволюционирует быстрее. Flash умирает раньше.",
      "people": "Верстальщики — высокооплачиваемые специалисты с 2007. Меньше времени на кроссбраузерность, больше на дизайн. CSS — полноценный язык.",
      "technology": "Браузеры внедряют стандарты быстрее. IE6 умирает в 2008. Мобильный веб появляется с готовыми инструментами. Респонсив — не проблема."
    },
    "conclusion": "Веб-дизайн стал профессиональнее, но потерял ту креативность ограничений, что породила уникальную эстетику веба 2000-х."
  },
  {
    "id": 19,
    "title": "Что было бы, если бы рекурсия была запрещена в программировании?",
    "intro": "Ранние языки программирования исключают рекурсию как опасную и непредсказуемую, меняя фундаментальные подходы к алгоритмам.",
    "changed": [
      "Итерация как единственный способ обработки данных",
      "Явные стеки вместо call stack",
      "Циклы вместо рекурсии везде",
      "Алгоритмы проектируются итеративно"
    ],
    "disappeared": [
      "Рекурсивные алгоритмы (деревья, графы)",
      "Функциональное программирование",
      "Хвостовая рекурсия и оптимизации",
      "Элегантные решения для сложных проблем"
    ],
    "consequences": {
      "internet": "Серверы обрабатывают запросы итеративно. Нет рекурсивных маршрутов. Middleware — это цепочки обработчиков. GraphQL невозможен.",
      "people": "Разработчики мыслят линейно. Меньше элегантности, больше шаблонов. Алгоритмическое мышление — это мастерство работы со стеком.",
      "technology": "Компиляторы проще. Нет оптимизации хвостовой рекурсии. Память контролируется явно. Ошибки переполнения стека ушли в прошлое."
    },
    "conclusion": "Код стал предсказуемее, но потерял математическую красоту — программирование стало ремеслом, а не искусством."
  },
  {
    "id": 20,
    "title": "Что было бы, если бы WebAssembly был стандартом в 2010?",
    "intro": "Бинарный формат для веба появляется одновременно с HTML5, позволяя компилировать любой язык в браузер на 8 лет раньше.",
    "changed": [
      "C++, Rust, Go в браузере с 2010",
      "Нативные игры и приложения в вебе",
      "Photoshop и AutoCAD как веб-приложения",
      "Высокопроизводительные веб-инструменты"
    ],
    "disappeared": [
      "Доминирование JavaScript",
      "Ограничения производительности веба",
      "Необходимость в плагинах (Flash, Java)",
      "Веб как платформа второго сорта"
    ],
    "consequences": {
      "internet": "Веб-приложения заменяют десктопные. Браузер — это ОС. Steam — это веб-платформа. Софтвер как сервис появляется на 5 лет раньше.",
      "people": "Разработчики C++ приходят в веб. Меньше фронтенд-разработчиков, больше системных программистов в браузере. Веб-ассемблер — обязательный навык.",
      "technology": "Браузеры — это виртуальные машины. Компиляторы таргетируют WASM. NPM — это реестр бинарных модулей. JavaScript — один из многих языков."
    },
    "conclusion": "Веб стал мощной платформой, но потерял свою демократичность — порог входа вырос, и веб-разработка стала уделом системных программистов."
  },
  {
    "id": 21,
    "title": "Что было бы, если бы React использовал Web Components вместо Virtual DOM?",
    "intro": "Facebook строит React на стандарте Web Components 2011 года, а не изобретает собственную абстракцию.",
    "changed": [
      "Нативные компоненты вместо React-специфичных",
      "Полная совместимость между фреймворками",
      "Браузерная оптимизация вместо ручной",
      "Стандартизированная экосистема"
    ],
    "disappeared": [
      "Virtual DOM и его overhead",
      "Проблемы с hydration",
      "Проприетарные системы компонентов",
      "Необходимость в React DevTools"
    ],
    "consequences": {
      "internet": "Компоненты работают в любом фреймворке. Легко мигрировать между технологиями. Браузеры оптимизируют рендеринг. Веб-стандарты сильнее.",
      "people": "Разработчики учат стандарты, а не фреймворки. Меньше lock-in. Легче сменить работу. Сообщество единое, а не разделённое по фреймворкам.",
      "technology": "Браузеры развивают компоненты. Нет необходимости в Vue, Angular, React — все используют один стандарт. Инновации в стандартах, а не фреймворках."
    },
    "conclusion": "Фронтенд стал стабильнее, но потерял ту конкурентную гонку фреймворков, что двигала инновации последнее десятилетие."
  },
  {
    "id": 22,
    "title": "Что было бы, если бы SQL никогда не изобрели?",
    "intro": "Реляционные базы данных используют собственные API или графические интерфейсы, а не универсальный декларативный язык.",
    "changed": [
      "Каждая СУБД со своим языком запросов",
      "Визуальные конструкторы запросов",
      "Программные API вместо SQL",
      "Меньше абстракции, больше контроля"
    ],
    "disappeared": [
      "Универсальный язык для баз данных",
      "ORM как необходимый слой абстракции",
      "Переносимость между СУБД",
      "SQL-инъекции как класс уязвимостей"
    ],
    "consequences": {
      "internet": "Сайты тесно связаны с конкретной СУБД. Миграции между базами невозможны. Меньше стандартизации. Больше vendor lock-in.",
      "people": "Разработчики специализируются на конкретных СУБД. DBA — обязательная роль в каждой команде. Меньше fullstack, больше специализации.",
      "technology": "NoSQL не нужен — каждая СУБД уникальна. Оптимизация запросов ручная. Производительность лучше, но разработка медленнее."
    },
    "conclusion": "Базы данных стали мощнее в руках экспертов, но индустрия потеряла ту универсальность, что позволила вебу масштабироваться так быстро."
  }
]
